# Tuple （元组）

# 与列表类似，但 元组的 元素不能修改

# 用于存储一串信息 ，数据之间用 ，（逗号）分隔

# 元组用 () 定义

# 常用于存储不同类型的数据
info_tuple = ("zhangsan",18,1.75)

# 创建空元组（极少用）
empty_tuple = ()

# 创建只有一个元素的元组（在元素后面加上一个逗号，）
single_tuple = (5,)

"""
在Python 中，可以使用for 循环遍历
所有非数字型类型的变量：列表、元组、字典以及字符串
"""

# 实际中，除非能够确认元组中的数据类型，
# 否则针对元组的循环遍历需求并不是很多


info_tuple = ("小明",21,1.85)
info_str = "%s 年龄是 %d 身高是 %.2f" % info_tuple
print(info_str) # 输出：小明 年龄是 21 身高是 1.85


# 使用 list 函数可以把元组转换成列表
list(元组)

# 使用 tuple 函数可以把列表转换成元组
tuple(列表)

















